#Дан символ C. Вывести его код (то есть номер в кодовой таблице).

C = input("Введите символ: ")
code = ord(C)
print(f"Код символа '{C}': {code}")